import { WhoWeAreItemIF } from '@/api/site/types';

export const WHO_WE_ARE_ITEMS: WhoWeAreItemIF[] = [
    {
        title: 'Кто мы',
        text: 'Медиа-портал sorock.ru является независимым проектом, который занимается сбором, обработкой и размещением развлекательного и информационного контента. Спектр работ и услуг проекта является одним из самых широких и развитых в этом сегменте в рунете. Мы работаем и сотрудничаем с музыкантами, организаторами, смм-менеджерами, различными представителями СМИ, а также с другими представителями интеллектуальных сфер. Наш медиа-портал всегда рад новым партнёрам и друзьям, готов сотрудничать на взаимовыгодных условиях.',
    },
    {
        title: 'Наша философия',
        text: 'Быть честными, справедливыми и непредвзятыми в оценках музыкальной сферы. Не оставлять без ответа ни один адекватный вопрос нам, всегда помогать развиваться тем, кто этого хочет. Стараемся популяризировать мировую культуру и соответствовать в своей деятельности настоящему духу современности.',
    },
    {
        title: 'Для кого',
        text: 'Мы работаем для всех ценитилей настоящего искусства и развлечения, вне зависимости от их уровня познаний и предпочтений. Каждый любитель качественного контента сможет найти на нашем проекте что-нибудь на свой вкус.',
    },
];
