import { ServerErrorT } from '@/helpers/validation/codes/codes.types';

export const SERVER_CODES = {
    C500: '500',
    C501: '501',
    C502: '502',
    C503: '503',
    C401: '401',
    C421: '421',
    C404: '404',
    C405: '405',
    C406: '406',
} as const;

export const SERVER_ERRORS: ServerErrorT = {
    '500': 'Ошибка сервера',
    '501': 'Ошибка сервера',
    '502': 'Ошибка сервера',
    '503': 'Ошибка сервера',
    '401': 'Вы не авторизованы',
    '421': 'Токен не найден',
    '404': 'Страница не найдена',
    '405': 'Пользователь не найден',
    '406': 'Неверный запрос',
};

export const ERRORS_CODES: Record<string, string> = {
    er150: 'Страница музыканта не найдена',
    er200: 'Поле обязательно для заполнения',
    er201: 'Значение поля слишком маленькое',
    er202: 'Значение поля слишком большое',
    er203: 'Введите корректное значение',
    er204: 'Пароль и подтверждение не совпадают',
    er205: 'Не удалось зарегистрировать юзера, возможно, логин уже занят',
    er206: 'В поле содержатся недопустимые символы',
    er207: 'Значение поля не является электронной почтой',
    er208: 'Такой email уже существует',
    er209: 'Неправильный логин или пароль',
    er210: 'Не удалось подтвердить аккаунт, попробуйте запросить письмо с подтверждением повторно',
    er211: 'Не удалось подтвердить аккаунт, пользователь не обнаружен',
    er212: 'Пользователь уже активирован',
    er213: 'Не удалось сменить пароль',
    er214: 'Страница не найдена',
    er215: 'Один или несколько файлов повреждены или превышают допустимый размер',
    er216: 'Один или несколько файлов имеют неверный тип',
    er217: 'Недостаточно прав',
    er218: 'Не удалось загрузить файл',
    er219: 'Данные не являются числом',
    er220: 'Неверный запрос',
    er221: 'Неверная длинна значения',
    er222: 'Для продолжения необходимо войти в аккаунт',
    er900: 'Неизвестная ошибка',
};

export const SUCCESS_CODES: Record<string, string> = {
    s101: 'Пароль успешно обновлен',
    s102: 'Письмо успешно отправлено',
    s103: 'Пользователь успешно подтвержден',
    s104: 'Вы успешно зарегистрировались Войдите в аккаунт, используя электронную почту и пароль, указанные при регистрации.',
    s105: 'Вы успешно авторизовались',
};
